<template>
  <div class="newsinfo-container">
    <h3 class="title">{{newInfoData[this.id].title}}</h3>
    <p class="subtitle">
      <span>发表时间：{{newInfoData[this.id].add_time | dateFormat}}</span>
      <span>点击：{{newInfoData[this.id].click}}次</span>
    </p>
    <hr class="hr">
    <!-- 描述 -->
    <div class="content">
      <p>{{newInfoData[this.id].zhaiyao}}</p>
      <img :src="newInfoData[this.id].imgUrl" alt>
      <p v-html="newInfoData[this.id].content"></p>
    </div>
    <!-- 评论区域 子组件s-->
    <comment-box :id="this.id"></comment-box>
  </div>
</template>

<script>
//导入 评论子组件
import comment from "../subcomponents/comment.vue";
export default {
  data() {
    return {
      //http://localhost:3000/#/home/newsinfo/12   获取传递的参数中的id
      id: this.$route.params.id, 
      newInfoData: [
        {
          id: 0,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 8
        },
        {
          id: 1,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 10
        },
        {
          id: 2,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 22
        },
        {
          id: 3,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 30
        },
        {
          id: 4,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 7
        },
        {
          id: 5,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 11
        },
        {
          id: 6,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 15
        },
        {
          id: 7,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 8
        },
        {
          id: 8,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 18
        },
        {
          id: 9,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 28
        },
        {
          id: 10,
          title: "英工党领袖:英谈判失败 目前的脱欧协议不可接受",
          add_time: "2018-04-16T03:50:28.0000Z",
          zhaiyao:
            "中新网11月27日电 据俄罗斯卫星通讯社报道，当地时间26日，英国工党领袖杰里米∙科尔宾称，首相特蕾莎•梅与欧盟达成的脱欧协议无法接受，与布鲁塞尔谈判失败的英国政府已走到尽头。",
          imgUrl: require("../../../src/images/new04.jpg"),
          content:
            '<p>科尔宾在议会发言时表示:"昨天标志着政府在这场失败又可悲的谈判中走到尽头。这一协议是所有可能中最糟糕的一个，甚至是内阁成员都无法公开支持的文件。"</p><p>据报道，英国议会将于12月11日对该协议进行表决。科尔宾称，在下议院审议时不打算支持该协议。</p><p>科尔宾补充道:"你们的协议既得不到议会中党派的支持，也得不到整个国家的支持。"</p><p>据悉，英国应于2019年3月底前脱欧。如果议会没能批准协议文本，则英国可能无协议脱欧，这将对该国的局势产生消极影响。11月26日，特雷莎•梅在下议院发表讲话时，呼吁议员们支持她与欧盟达成的脱欧协议及其附属文件。日前，她曾表示，伦敦与布鲁塞尔已最终协商好文件条款。</p>',
          click: 80
        }
      ]
    };
  },
  components: {
    "comment-box": comment
  }
};
</script>

<style lang="scss" scoped>
.newsinfo-container {
  padding: 0 15px;
  margin: 15px 0 0;
  .title {
    font-size: 14px;
    text-align: center;
    color: #333;
  }
  .hr {
    margin: 5px 0;
  }
  .subtitle {
    font-size: 12px;
    color: #226aff;
    margin-bottom: 5px;
    display: flex;
    justify-content: space-between;
  }
  .content {
    color: #333;
    font-size: 12px;
    text-indent: 24px;
    img {
      width: 100%;
    }
  }
}
</style>
